patodelao/esp32_mini_tool/esp32cam/sdkconfig.defaults
# Configuración base del nodo cámara (AI-Thinker ESP32-CAM = ESP32 clásico).
#
# sdkconfig está en .gitignore, así que todo lo que deba sobrevivir a un
# checkout nuevo va acá. Fijar el target evita el clásico "idf.py build genera
# sdkconfig para el default y el link falla".
CONFIG_IDF_TARGET="esp32"

# El AI-Thinker ESP32-CAM tiene 4 MB de flash.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Tabla con dos ranuras de app, necesaria para actualizar por Wi-Fi.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# El firmware llega por POST en una sola conexión larga.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# PSRAM: la cámara la necesita para los frame buffers en JPEG. El AI-Thinker la
# trae (4 MB, QSPI). IGNORE_NOTFOUND es la red de seguridad: si por lo que sea
# no monta, el arranque NO se aborta —camera_init() falla solito y el nodo
# sigue vivo como nodo OTA— en vez de quedar en un cuelgue que obligaría a
# volver al cable.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# La cámara sube el binario: subimos el límite de tamaño de app en la ranura ya
# está cubierto por la tabla (1.87 MB). Nada más que tocar acá.
